zjcszn/embeded-lib/4. peripheral drivers/on-chip periphs/bus/4.1.1 usart/st/uart_emul/stm32h7xx_hal_uart_emul.c
    /* Set the UART Emulation DMA transfer complete callback */
    TimHandle.hdma[TIM_DMA_ID_CC1]->XferCpltCallback = UART_Emul_DMATransmitCplt;

    /* Set the DMA error callback */
    TimHandle.hdma[TIM_DMA_ID_CC1]->XferErrorCallback = UART_Emul_DMAError;

    /* Format first Frame to be sent */
    if (huart->TxXferCount == FIRST_BYTE)
    {
      /* Format Frame to be sent */
      UART_Emul_TransmitFormatFrame(huart, *(pData), (uint32_t*)pFirstBuffer_Tx);

      TimHandle.Instance->CNT = 0;

      /* Enable the Capture compare channel */
      TIM_CCxChannelCmd(TIM1, TIM_CHANNEL_1, TIM_CCx_ENABLE);

      /* Send Frames */
      UART_Emul_TransmitFrame(huart);
    }

    if ((huart->TxXferCount == FIRST_BYTE) && (huart->TxXferCount < Size))
    { 
      /* Format Second Frame to be sent */
      UART_Emul_TransmitFormatFrame(huart, *(pData + huart->TxXferCount), (uint32_t*)pSecondBuffer_Tx);
    }

    return HAL_OK;
  }
  else
  {
    return HAL_BUSY;
  }
}

/**
 * @brief  Receives an amount of data in non blocking mode.
 * @param  huart: UART Emulation handle
 * @param  pData: Data to be received
 * @param  Size: Amount of data to be received
 * @retval HAL status
*/
HAL_StatusTypeDef HAL_UART_Emul_Receive_DMA(UART_Emul_HandleTypeDef *huart, uint8_t *pData, uint16_t Size)
{
  uint32_t tmp = 0;

  tmp = huart->State;
  if ((tmp == HAL_UART_EMUL_STATE_READY) || (tmp == HAL_UART_EMUL_STATE_BUSY_TX))
  {
    if ((pData == NULL ) || (Size == 0))
    {
      return HAL_ERROR;
    }

    huart->pRxBuffPtr = pData;
    huart->RxXferSize = Size;
    huart->RxXferCount = 1;

    huart->ErrorCode = HAL_UART_EMUL_ERROR_NONE;

    /* Check if a transmit process is ongoing or not */
    if (huart->State == HAL_UART_EMUL_STATE_BUSY_TX)
    {
      huart->State = HAL_UART_EMUL_STATE_BUSY_TX_RX;
    }
    else
    {
      huart->State = HAL_UART_EMUL_STATE_BUSY_RX;
    }

    /* Set the UART Emulation DMA transfer complete callback */
    TimHandle.hdma[TIM_DMA_ID_CC2]->XferCpltCallback = UART_Emul_DMAReceiveCplt;

    /* Set the DMA error callback */
    TimHandle.hdma[TIM_DMA_ID_CC2]->XferErrorCallback = UART_Emul_DMAError;

    /* Enable the Capture compare channel */
    TIM_CCxChannelCmd(TIM1, TIM_CHANNEL_2, TIM_CCx_ENABLE);

    return HAL_OK;
  }
  else
  {
    return HAL_BUSY;
  }
}

/**
  * @brief  Initializes the UART Emulation Transfer Complete.
  * @param  huart: UART Emulation Handle
  * @retval None
  */
__weak void HAL_UART_Emul_RxCpltCallback(UART_Emul_HandleTypeDef *huart)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_UART_Emul_TransferComplet could be implemented in the user file
   */
}

/**
  * @}
  */
/*===============================================================================
            #####  Interrupt Handlers used in UART Emulation #####
  ===============================================================================
*/

/**
* @brief  This function handles DMA interrupt request for TC.
* @param  None
* @retval None
*/
void UART_EMUL_RX_DMA_IRQHandler(void)
{ 
  /* Increment Counter of Frame */
  huart_emul->RxXferCount ++;

  /* Enable External interrupt for next Frame */
  EXTI->IMR1 |= huart_emul->Init.RxPinNumber;


  if (__HAL_DMA_GET_FLAG(TimHandle.hdma[TIM_DMA_ID_CC2], __HAL_DMA_GET_TE_FLAG_INDEX(TimHandle.hdma[TIM_DMA_ID_CC2])) != RESET)
  {
    UART_Emul_DMAError(&hdma_rx);
  }

  /* Clear the transfer complete flag */
  __HAL_DMA_CLEAR_FLAG(TimHandle.hdma[TIM_DMA_ID_CC2], __HAL_DMA_GET_TC_FLAG_INDEX(TimHandle.hdma[TIM_DMA_ID_CC2]));
 
  /* Transfer complete callback */
  TimHandle.hdma[TIM_DMA_ID_CC2]->XferCpltCallback(TimHandle.hdma[TIM_DMA_ID_CC2]);
}

void PULSE_HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin);
/**
  * @brief EXTI line detection callbacks
  * @param GPIO_Pin: Specifies the pins connected EXTI line
  * @retval None
  */
void UART_EMUL_EXTI_RX(uint16_t GPIO_Pin)
{ 	
  uint32_t tmpreceive = 0;
  uint32_t tmpformat = 0;
  uint32_t tmpdata = 0;

  if(GPIO_Pin != huart_emul->Init.RxPinNumber){
	  PULSE_HAL_GPIO_EXTI_Callback(GPIO_Pin);
	  return;
  }
  
  /* Disable EXTI line Rx */
  EXTI->IMR1 &= ~huart_emul->Init.RxPinNumber;

  if ((huart_emul->RxXferCount % 2) != 0)
  {
    tmpreceive = (uint32_t)pFirstBuffer_Rx;
    tmpformat = (uint32_t)pSecondBuffer_Rx;
  }
  else
  {
    tmpreceive = (uint32_t)pSecondBuffer_Rx;
    tmpformat = (uint32_t)pFirstBuffer_Rx;
  }

  /* Start receiver mode in the reference point*/
  UART_Emul_ReceiveFrame(huart_emul, (uint32_t*)tmpreceive);

  if (huart_emul->RxXferCount > 1)
  { 
  /* Format frame */
    *(uint8_t*)((huart_emul->pRxBuffPtr) + (huart_emul->RxXferCount - 2)) = UART_Emul_ReceiveFormatFrame(huart_emul, (uint32_t*)tmpformat, (uint8_t)tmpdata);
  }
}

/**
* @brief  This function handles DMA interrupt request for TC.
* @param  None
* @retval None
*/
void UART_EMUL_TX_DMA_IRQHandler(void)
{ 
  if (__HAL_DMA_GET_FLAG(TimHandle.hdma[TIM_DMA_ID_CC1], __HAL_DMA_GET_TE_FLAG_INDEX(TimHandle.hdma[TIM_DMA_ID_CC1])) != RESET)
  {
    UART_Emul_DMAError(&hdma_tx);
  }

  /* Clear the transfer complete flag */
  __HAL_DMA_CLEAR_FLAG(TimHandle.hdma[TIM_DMA_ID_CC1], __HAL_DMA_GET_TC_FLAG_INDEX(TimHandle.hdma[TIM_DMA_ID_CC1]));
   
  /* Transfer complete callback */
  TimHandle.hdma[TIM_DMA_ID_CC1]->XferCpltCallback(TimHandle.hdma[TIM_DMA_ID_CC1]);
}

/**
  * @brief  This function handles UART Emulation request.
  * @param  huart: UART Emulation handle
  * @retval None
  */
void HAL_UART_Emul_IRQHandler(UART_Emul_HandleTypeDef *huart)
{
  uint32_t tmp = 0;

  tmp = __HAL_UART_EMUL_GET_FLAG(huart, UART_EMUL_FLAG_PE);
  /* UART Emulation parity error  occurred */
  if (tmp != RESET)
  {
    __HAL_UART_EMUL_CLEAR_FLAG(huart, UART_EMUL_FLAG_PE);

    huart->ErrorCode |= HAL_UART_EMUL_ERROR_PE;
  }

  tmp = __HAL_UART_EMUL_GET_FLAG(huart, UART_EMUL_FLAG_FE);
  /* UART Emulation frame error occurred */
  if (tmp != RESET)
  {
    __HAL_UART_EMUL_CLEAR_FLAG(huart, UART_EMUL_FLAG_FE);

    huart->ErrorCode |= HAL_UART_EMUL_ERROR_FE;
  }

  tmp = __HAL_UART_EMUL_GET_FLAG(huart, UART_EMUL_FLAG_TC);
  /* UART Emulation in mode Transmitter */
  if ((tmp != RESET))
  {
    __HAL_UART_EMUL_CLEAR_FLAG(huart, UART_EMUL_FLAG_TC);
  }

  tmp = __HAL_UART_EMUL_GET_FLAG(huart, UART_EMUL_FLAG_RC);
  /* UART Emulation in mode Receiver */
  if ((tmp != RESET))
  {
    __HAL_UART_EMUL_CLEAR_FLAG(huart, UART_EMUL_FLAG_RC);
  }

  if (huart->ErrorCode != HAL_UART_EMUL_ERROR_NONE)
  {
    /* Set the UART Emulation state ready to be able to start again the process */
    huart->State = HAL_UART_EMUL_STATE_READY;

