zjcszn/embeded-lib/4. peripheral drivers/on-chip periphs/bus/4.1.1 usart/st/uart_emul/stm32h7xx_hal_uart_emul.c
    HAL_UART_Emul_ErrorCallback(huart);
  }
}

/**
  * @}
  */

/** @defgroup UART_Emulation_Group3 Peripheral State and Errors functions
  *  @brief   UART Emulation State and Errors functions
  *
@verbatim
  ==============================================================================
                 ##### Peripheral State and Errors functions #####
  ==============================================================================
 [..]
   This subsection provides a set of functions allowing to return the State of
   UART Emulation communication process, return Peripheral Errors occured during communication
   process
   (+) HAL_UART_Emul_GetState() API can be helpful to check in run-time the state of the UART Emulation.
   (+) HAL_UART_Emul_GetError() check in run-time errors that could be occured durung communication.

@endverbatim
  * @{
  */

/**
  * @brief  Returns the UART Emulation state.
  * @param  huart: UART Emulation handle
  * @retval HAL state
  */
HAL_UART_Emul_StateTypeDef HAL_UART_Emul_GetState(UART_Emul_HandleTypeDef *huart)
{
  return huart->State;
}

/**
* @brief  Return the UART Emulation error code
* @param  huart : pointer to UART_Emul_HandleTypeDef structure that contains
  *              the configuration information for the specified UART Emulation.
* @retval UART Emulation Error Code
*/
uint32_t HAL_UART_Emul_GetError(UART_Emul_HandleTypeDef *huart)
{
  return huart->ErrorCode;
}

/**
  * @}
  */
/*===============================================================================
            #####  Private function for UART Emulation #####
  ===============================================================================
*/

/**
  * @brief  This function is executed in case of Receive Complete for last frame.
  * @param  None
  * @retval None
  */
static void UART_Emul_DMAReceiveCplt(DMA_HandleTypeDef *hdma)
{
  uint32_t tmpformat = 0;
  uint32_t tmpdata = 0;
  if (huart_emul->RxXferCount > huart_emul->RxXferSize)
  {
    /*Disable EXTI line Rx  */
    EXTI->IMR1 &= ~huart_emul->Init.RxPinNumber;


	  
    if ((huart_emul->RxXferCount % 2) == 0)
    {
      tmpformat = (uint32_t)pFirstBuffer_Rx;
    }

    else
    {
      tmpformat = (uint32_t)pSecondBuffer_Rx;
    }
 
    /* Formatted Last Frame */
    *(uint8_t*)((huart_emul->pRxBuffPtr) + (huart_emul->RxXferCount - 2)) = UART_Emul_ReceiveFormatFrame(huart_emul, (uint32_t*)tmpformat, (uint8_t)tmpdata);

    /* Set RC falg receiver complete */
    __HAL_UART_EMUL_SET_FLAG(huart_emul, UART_EMUL_FLAG_RC);

    /* De_Initialize counter frame for Rx */
    huart_emul->RxXferCount = 0;

    /* Initialize the UART Emulation  state */
    huart_emul->ErrorCode = HAL_UART_EMUL_ERROR_NONE;

    /* Check if a transmit process is ongoing or not */
    if (huart_emul->State == HAL_UART_EMUL_STATE_BUSY_TX_RX)
    {
      huart_emul->State = HAL_UART_EMUL_STATE_BUSY_TX;
    }
    else
    {
      huart_emul->State = HAL_UART_EMUL_STATE_READY;
    }

    /* Handle for UART Emulation Receive Complete */
    HAL_UART_Emul_RxCpltCallback(huart_emul);
  }
}

/**
 * @brief  Receives an amount of Frames.
 * @param  huart: UART Emulation handle
 * @param  pData: Frame to be Received
 * @retval None
*/
static void UART_Emul_ReceiveFrame(UART_Emul_HandleTypeDef *huart, uint32_t *pData)
{
	uint32_t tmp_sr =0;
	uint32_t tmp_ds =0;
	uint32_t tmp_size =0;
	uint32_t tmp_arr =0;

	tmp_arr = TIM1->ARR;
	tmp_ds = (uint32_t)pData;
	tmp_sr = (uint32_t) & (huart->RxPortName->IDR);
	tmp_size =  __HAL_UART_EMUL_FRAME_LENGTH(huart);

	/* Enable the transfer complete interrupt */
	__HAL_DMA_ENABLE_IT(&hdma_rx, DMA_IT_TC);

	/* Enable the transfer Error interrupt */
	__HAL_DMA_ENABLE_IT(&hdma_rx, DMA_IT_TE);

	/* Configure DMA Stream data length */
	((DMA_Stream_TypeDef*)hdma_rx.Instance)->NDTR = tmp_size;
	
	/* Configure DMA Stream source address */
	((DMA_Stream_TypeDef*)hdma_rx.Instance)->PAR = tmp_sr;

	/* Configure DMA Stream destination address */
	((DMA_Stream_TypeDef*)hdma_rx.Instance)->M0AR = tmp_ds;

	/* Enable the Peripheral */
	__HAL_DMA_ENABLE(&hdma_rx);

	if ((huart_emul->RxXferCount == 1)||(huart->State != HAL_UART_EMUL_STATE_BUSY_TX_RX))
	{
	TIM1->CCR2 = ((TIM1->CNT + (tmp_arr / 2)) % tmp_arr);
	}

	/* Enable the TIM Update DMA request */
	__HAL_TIM_ENABLE_DMA(&TimHandle, TIM_DMA_CC2);

	/* Enable Timer */
	__HAL_TIM_ENABLE(&TimHandle);

}

/**
  * @brief  Configures the UART Emulation peripheral
             + Enable clock for all peripherals Timer, GPIO
             + DMA2 Configuration channel, Stream, Mode,...
  * @param  huart: UART Emulation handle
  * @retval None
  */
static void UART_Emul_SetConfig (UART_Emul_HandleTypeDef *huart)
{
	uint32_t bit_time = 0;

	/* Check the parameters */
	assert_param(IS_UART_EMUL_BAUDRATE(huart->Init.BaudRate));
	assert_param(IS_UART_EMUL_WORD_LENGTH(huart->Init.WordLength));
	assert_param(IS_UART_EMUL_STOPBITS(huart->Init.StopBits));
	assert_param(IS_UART_EMUL_MODE(huart->Init.Mode));
	assert_param(IS_UART_EMUL_MODE(huart->Init.Parity));

	/* Init Bit Time */
	if((HAL_RCC_GetSysClockFreq()/HAL_RCC_GetPCLK2Freq()== 1) | (HAL_RCC_GetSysClockFreq()/HAL_RCC_GetPCLK2Freq()== 2))
	{
		bit_time = ((uint32_t) ((HAL_RCC_GetSysClockFreq()/huart->Init.BaudRate) - 1));	
	}
	else
	{
		bit_time = ((uint32_t) (((HAL_RCC_GetPCLK2Freq()*2)/huart->Init.BaudRate) - 1));
	}

	/*##-1- Configure  the Timer peripheral (TIM1) in Bit Delay ##############*/
	/* Initialize TIM1 peripheral as follow:
	+ Period = TimerPeriod 
	+ Prescaler = 0
	+ ClockDivision = 0
	+ Counter direction = Up
	*/
	TimHandle.Instance            = TIM1;
	TimHandle.Init.Period         = bit_time;
	TimHandle.Init.Prescaler      = 0;
	TimHandle.Init.ClockDivision  = 0;
	TimHandle.Init.CounterMode    = TIM_COUNTERMODE_UP;
	HAL_TIM_Base_Init(&TimHandle);

	if (huart->Init.Mode == UART_EMUL_MODE_TX)
	{
		/* Configure UART Emulation in Transmission mode */
		UART_Emul_SetConfig_DMATx();
	}
	else if (huart->Init.Mode == UART_EMUL_MODE_RX)
	{
		/* Configure UART Emulation in Reception mode */
		UART_Emul_SetConfig_DMARx();
	}
	else
	{
		/* Configure UART Emulation in full-duplex mode */
		UART_Emul_SetConfig_DMATx();
		UART_Emul_SetConfig_DMARx();
	}
}

/**
  * @brief  Configures the DMA for UART Emulation transmission.
             + DMA2 Configuration channel, Stream, Mode, ...
  * @param  None
  * @retval None
  */
static void UART_Emul_SetConfig_DMATx(void)
{
	/* Init Idle */
	HAL_GPIO_WritePin((huart_emul->TxPortName), (huart_emul->Init.TxPinNumber), GPIO_PIN_SET);

	/*##-1- Configure  DMA For UART Emulation TX #############################*/
	/* Set the parameters to be configured */
    hdma_tx.Init.Request             = DMA_REQUEST_TIM1_CH1;    /* 定时器1比较1 */  
    hdma_tx.Init.Direction           = DMA_MEMORY_TO_PERIPH;    /* 传输方向是从存储器到外设 */  
    hdma_tx.Init.PeriphInc           = DMA_PINC_DISABLE;        /* 外设地址自增禁止 */ 
    hdma_tx.Init.MemInc              = DMA_MINC_ENABLE;         /* 存储器地址自增使能 */  
    hdma_tx.Init.PeriphDataAlignment = DMA_PDATAALIGN_WORD;     /* 外设数据传输位宽选择字，即32bit */     
    hdma_tx.Init.MemDataAlignment    = DMA_MDATAALIGN_WORD;     /* 存储器数据传输位宽选择字，即32bit */    
    hdma_tx.Init.Mode                = DMA_NORMAL;              /* 单次模式 */   
    hdma_tx.Init.Priority            = DMA_PRIORITY_VERY_HIGH;  /* 优先级 very high */  
    hdma_tx.Init.FIFOMode            = DMA_FIFOMODE_DISABLE;    /* 禁止FIFO*/
    hdma_tx.Init.FIFOThreshold       = DMA_FIFO_THRESHOLD_FULL; /* 禁止FIFO此位不起作用，用于设置阀值 */
    hdma_tx.Init.MemBurst            = DMA_MBURST_SINGLE;       /* 禁止FIFO此位不起作用，用于存储器突发 */
    hdma_tx.Init.PeriphBurst         = DMA_PBURST_SINGLE;       /* 禁止FIFO此位不起作用，用于外设突发 */

